Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: أفغير الله أبتغي حكما وهو الذي أنزل إليكم الكتاب مفصلا والذين آتيناهم الكتاب يعلمون أنه منزل من ربك بالحق فلا تكونن من الممترين
en: [Say (O Muhammad صلى الله عليه وسلم)] "Shall I seek a judge other than Allah while it is He Who has sent down unto you the Book (the Qur'an), explained in detail." Those unto whom We gave the Scripture [the Taurat (Torah) and the Injeel (Gospel)] know that it is revealed from your Lord in truth. So be not you of those who doubt.

source: وتمت كلمت ربك صدقا وعدلا لا مبدل لكلماته وهو السميع العليم
en: And the Word of your Lord has been fulfilled in truth and in justice. None can change His Words. And He is the All-Hearer, the All-Knower.

source: وإن تطع أكثر من في الأرض يضلوك عن سبيل الله إن يتبعون إلا الظن وإن هم إلا يخرصون
en: And if you obey most of those on the earth, they will mislead you far away from Allah's Path. They follow nothing but conjectures, and they do nothing but lie.

source: إن ربك هو أعلم من يضل عن سبيله وهو أعلم بالمهتدين
en: Verily, your Lord! It is He Who knows best who strays from His Way, and He knows best the rightly guided ones.

source: فكلوا مما ذكر اسم الله عليه إن كنتم بآياته مؤمنين
en: So eat of that (meat) on which Allah's Name has been pronounced (while slaughtering the animal), if you are believers in His Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.).

source: وما لكم ألا تأكلوا مما ذكر اسم الله عليه وقد فصل لكم ما حرم عليكم إلا ما اضطررتم إليه وإن كثيرا ليضلون بأهوائهم بغير علم إن ربك هو أعلم بالمعتدين
en: And why should you not eat of that (meat) on which Allah's Name has been pronounced (at the time of slaughtering the animal), while He has explained to you in detail what is forbidden to you, except under compulsion of necessity? And surely many do lead (mankind) astray by their own desires through lack of knowledge. Certainly your Lord knows best the transgressors.

source: وذروا ظاهر الإثم وباطنه إن الذين يكسبون الإثم سيجزون بما كانوا يقترفون
en: Leave (O mankind, all kinds of) sin, open and secret. Verily, those who commit sin will get due recompense for that which they used to commit.

source: ولا تأكلوا مما لم يذكر اسم الله عليه وإنه لفسق وإن الشياطين ليوحون إلى أوليائهم ليجادلوكم وإن أطعتموهم إنكم لمشركون
en: Eat not (O believers) of that (meat) on which Allah's Name has not been pronounced (at the time of the slaughtering of the animal), for sure it is Fisq (a sin and disobedience of Allah). And certainly, the Shayatin (devils) do inspire their friends (from mankind) to dispute with you, and if you obey them [by making Al-Maitah (a dead animal) legal by eating it], then you would indeed be Mushrikun (polytheists); [because they (devils and their friends) made lawful to you to eat that which Allah has made unlawful to eat and you obeyed them by considering it lawful to eat, and by doing so you worshipped them; and to worship others besides Allah is polytheism].

source: أومن كان ميتا فأحييناه وجعلنا له نورا يمشي به في الناس كمن مثله في الظلمات ليس بخارج منها كذلك زين للكافرين ما كانوا يعملون
en: Is he who was dead (without Faith by ignorance and disbelief) and We gave him life (by knowledge and Faith) and set for him a light (of Belief) whereby he can walk amongst men - like him who is in the darkness (of disbelief, polytheism and hypocrisy) from which he can never come out? Thus it is made fair-seeming to the disbelievers that which they used to do.

source: وكذلك جعلنا في كل قرية أكابر مجرميها ليمكروا فيها وما يمكرون إلا بأنفسهم وما يشعرون
en: And thus We have set up in every town great ones of its wicked people to plot therein. But they plot not except against their ownselves, and they perceive (it) not.

source: وإذا جاءتهم آية قالوا لن نؤمن حتى نؤتى مثل ما أوتي رسل الله الله أعلم حيث يجعل رسالته سيصيب الذين أجرموا صغار عند الله وعذاب شديد بما كانوا يمكرون
en: And when there comes to them a sign (from Allah) they say: "We shall not believe until we receive the like of that which the Messengers of Allah had received." Allah knows best with whom to place His Message. Humiliation and disgrace from Allah and a severe torment will overtake the criminals (polytheists, sinners) for that which they used to plot.

source: فمن يرد الله أن يهديه يشرح صدره للإسلام ومن يرد أن يضله يجعل صدره ضيقا حرجا كأنما يصعد في السماء كذلك يجعل الله الرجس على الذين لا يؤمنون
en: And whomsoever Allah wills to guide, He opens his breast to Islam; and whomsoever He wills to send astray, He makes his breast closed and constricted, as if he is climbing up to the sky. Thus Allah puts the wrath on those who believe not.

source: وهذا صراط ربك مستقيما قد فصلنا الآيات لقوم يذكرون
en: And this is the Path of your Lord (the Qur'an and Islam) leading Straight. We have detailed Our Revelations for a people who take heed.

source: لهم دار السلام عند ربهم وهو وليهم بما كانوا يعملون
en: For them will be the home of peace (Paradise) with their Lord. And He will be their Wali (Helper and Protector) because of what they used to do.

source: ويوم يحشرهم جميعا يا معشر الجن قد استكثرتم من الإنس وقال أولياؤهم من الإنس ربنا استمتع بعضنا ببعض وبلغنا أجلنا الذي أجلت لنا قال النار مثواكم خالدين فيها إلا ما شاء الله إن ربك حكيم عليم
en: And on the Day when He will gather them (all) together (and say): "O you assembly of jinn! Many did you mislead of men," and their Auliya' (friends and helpers) amongst men will say: "Our Lord! We benefited one from the other, but now we have reached our appointed term which You did appoint for us." He will say: "The Fire be your dwelling-place, you will dwell therein forever, except as Allah may will. Certainly your Lord is All-Wise, All-Knowing."

source: وكذلك نولي بعض الظالمين بعضا بما كانوا يكسبون
en: And thus We do make the Zalimun (polytheists and wrong-doers) Auliya' (supporters and helpers) of one another (in committing crimes), because of that which they used to earn.

source: يا معشر الجن والإنس ألم يأتكم رسل منكم يقصون عليكم آياتي وينذرونكم لقاء يومكم هذا قالوا شهدنا على أنفسنا وغرتهم الحياة الدنيا وشهدوا على أنفسهم أنهم كانوا كافرين
en: O you assembly of jinn and mankind! "Did not there come to you Messengers from amongst you, reciting unto you My Verses and warning you of the meeting of this Day of yours?" They will say: "We bear witness against ourselves." It was the life of this world that deceived them. And they will bear witness against themselves that they were disbelievers.

source: ذلك أن لم يكن ربك مهلك القرى بظلم وأهلها غافلون
en: This is because your Lord would not destroy the (populations of) towns for their wrong-doing (i.e. associating others in worship along with Allah) while their people were unaware (so the Messengers were sent).

source: ولكل درجات مما عملوا وما ربك بغافل عما يعملون
en: For all there will be degrees (or ranks) according to what they did. And your Lord is not unaware of what they do.

source: وربك الغني ذو الرحمة إن يشأ يذهبكم ويستخلف من بعدكم ما يشاء كما أنشأكم من ذرية قوم آخرين
en: And your Lord is Rich (Free of all needs), full of Mercy; if He wills, He can destroy you, and in your place make whom He wills as your successors, as He raised you from the seed of other people.

source: إن ما توعدون لآت وما أنتم بمعجزين
en: Surely, that which you are promised will verily come to pass, and you cannot escape (from the punishment of Allah).

source: قل يا قوم اعملوا على مكانتكم إني عامل فسوف تعلمون من تكون له عاقبة الدار إنه لا يفلح الظالمون
en: Say (O Muhammad صلى الله عليه وسلم): "O my people! Work according to your way, surely, I too am working (in my way), and you will come to know for which of us will be the (happy) end in the Hereafter. Certainly the Zalimun (polytheists and wrong-doers) will not be successful."

source: وجعلوا لله مما ذرأ من الحرث والأنعام نصيبا فقالوا هذا لله بزعمهم وهذا لشركائنا فما كان لشركائهم فلا يصل إلى الله وما كان لله فهو يصل إلى شركائهم ساء ما يحكمون
en: And they assign to Allah a share of the tilth and cattle which He has created, and they say: "This is for Allah according to their claim, and this is for our (Allah's so-called) partners." But the share of their (Allah's so-called) "partners" reaches not Allah, while the share of Allah reaches their (Allah's so-called) "partners"! Evil is the way they judge!

source: وكذلك زين لكثير من المشركين قتل أولادهم شركاؤهم ليردوهم وليلبسوا عليهم دينهم ولو شاء الله ما فعلوه فذرهم وما يفترون
en: And so to many of the Mushrikun (polytheists - see V.2:105) their (Allah's so-called) "partners" have made fair-seeming the killing of their children, in order to lead them to their own destruction and cause confusion in their religion. And if Allah had willed, they would not have done so. So leave them alone with their fabrications.

source: وقالوا هذه أنعام وحرث حجر لا يطعمها إلا من نشاء بزعمهم وأنعام حرمت ظهورها وأنعام لا يذكرون اسم الله عليها افتراء عليه سيجزيهم بما كانوا يفترون
en: And according to their claim, they say that such and such cattle and crops are forbidden, and none should eat of them except those whom we allow. And (they say) there are cattle forbidden to be used for burden (or any other work), and cattle on which (at slaughtering) the Name of Allah is not pronounced; lying against Him (Allah). He will recompense them for what they used to fabricate.

source: وقالوا ما في بطون هذه الأنعام خالصة لذكورنا ومحرم على أزواجنا وإن يكن ميتة فهم فيه شركاء سيجزيهم وصفهم إنه حكيم عليم
en: And they say: "What is in the bellies of such and such cattle (milk or foetus) is for our males alone, and forbidden to our females (girls and women), but if it is born dead, then all have shares therein." He will punish them for their attribution (of such false orders to Allah). Verily, He is All-Wise, All-Knower. (Tafsir At-Tabari).

source: قد خسر الذين قتلوا أولادهم سفها بغير علم وحرموا ما رزقهم الله افتراء على الله قد ضلوا وما كانوا مهتدين
en: Indeed lost are they who have killed their children, foolishly, without knowledge, and have forbidden that which Allah has provided for them, inventing a lie against Allah. They have indeed gone astray and were not guided.

source: وهو الذي أنشأ جنات معروشات وغير معروشات والنخل والزرع مختلفا أكله والزيتون والرمان متشابها وغير متشابه كلوا من ثمره إذا أثمر وآتوا حقه يوم حصاده ولا تسرفوا إنه لا يحب المسرفين
en: And it is He Who produces gardens trellised and untrellised, and date-palms, and crops of different shape and taste (their fruits and their seeds) and olives, and pomegranates, similar (in kind) and different (in taste). Eat of their fruit when they ripen, but pay the due thereof (its Zakat according to Allah's Orders 1/10th or 1/20th) on the day of its harvest, and waste not by extravagance . Verily, He likes not Al-Musrifun (those who waste by extravagance),

source: ومن الأنعام حمولة وفرشا كلوا مما رزقكم الله ولا تتبعوا خطوات الشيطان إنه لكم عدو مبين
en: And of the cattle (are some) for burden (like camels) and (some are) small (unable to carry burden like sheep and goats - for food, meat, milk and wool). Eat of what Allah has provided for you, and follow not the footsteps of Shaitan (Satan). Surely he is to you an open enemy.

source: ثمانية أزواج من الضأن اثنين ومن المعز اثنين قل آلذكرين حرم أم الأنثيين أما اشتملت عليه أرحام الأنثيين نبئوني بعلم إن كنتم صادقين
en: Eight pairs: of the sheep two (male and female), and of the goats two (male and female). Say: "Has He forbidden the two males or the two females, or (the young) which the wombs of the two females enclose? Inform me with knowledge if you are truthful."

source: ومن الإبل اثنين ومن البقر اثنين قل آلذكرين حرم أم الأنثيين أما اشتملت عليه أرحام الأنثيين أم كنتم شهداء إذ وصاكم الله بهذا فمن أظلم ممن افترى على الله كذبا ليضل الناس بغير علم إن الله لا يهدي القوم الظالمين
en: And of the camels two (male and female), and of oxen two (male and female). Say: "Has He forbidden the two males or the two females or (the young) which the wombs of the two females enclose? Or were you present when Allah ordered you such a thing? Then who does more wrong than one who invents a lie against Allah, to lead mankind astray without knowledge. Certainly Allah guides not the people who are Zalimun (polytheists and wrong-doers)."

source: قل لا أجد في ما أوحي إلي محرما على طاعم يطعمه إلا أن يكون ميتة أو دما مسفوحا أو لحم خنزير فإنه رجس أو فسقا أهل لغير الله به فمن اضطر غير باغ ولا عاد فإن ربك غفور رحيم
en: Say (O Muhammad صلى الله عليه وسلم): "I find not in that which has been revealed to me anything forbidden to be eaten by one who wishes to eat it, unless it be Maitah (a dead animal) or blood poured forth (by slaughtering or the like), or the flesh of swine (pork); for that surely is impure or impious (unlawful) meat (of an animal) which is slaughtered as a sacrifice for others than Allah (or has been slaughtered for idols, or on which Allah's Name has not been mentioned while slaughtering). But whosoever is forced by necessity without wilful disobedience, nor transgressing due limits; (for him) certainly, your Lord is Oft-Forgiving, Most Merciful."

source: وعلى الذين هادوا حرمنا كل ذي ظفر ومن البقر والغنم حرمنا عليهم شحومهما إلا ما حملت ظهورهما أو الحوايا أو ما اختلط بعظم ذلك جزيناهم ببغيهم وإنا لصادقون
en: And unto those who are Jews, We forbade every (animal) with undivided hoof, and We forbade them the fat of the ox and the sheep except what adheres to their backs or their entrails, or is mixed up with a bone. Thus We recompensed them for their rebellion [committing crimes like murdering the Prophets and eating of Riba (usury)]. And verily, We are Truthful.

source: فإن كذبوك فقل ربكم ذو رحمة واسعة ولا يرد بأسه عن القوم المجرمين
en: If they (Jews) belie you (Muhammad صلى الله عليه وسلم) say: "Your Lord is the Owner of Vast Mercy, and never will His Wrath be turned back from the people who are Mujrimun (criminals, polytheists or sinners)."

source: سيقول الذين أشركوا لو شاء الله ما أشركنا ولا آباؤنا ولا حرمنا من شيء كذلك كذب الذين من قبلهم حتى ذاقوا بأسنا قل هل عندكم من علم فتخرجوه لنا إن تتبعون إلا الظن وإن أنتم إلا تخرصون
en: Those who took partners (in worship) with Allah will say: "If Allah had willed, we would not have taken partners (in worship) with Him, nor would our fathers, and we would not have forbidden anything (against His Will)." Likewise belied those who were before them, (they argued falsely with Allah's Messengers), till they tasted Our Wrath. Say: "Have you any knowledge (proof) that you can produce before us? Verily, you follow nothing but guess and you do nothing but lie."

source: قل فلله الحجة البالغة فلو شاء لهداكم أجمعين
en: Say: "With Allah is the perfect proof and argument, (i.e. the Oneness of Allah, the sending of His Messengers and His Holy Books to mankind); had He so willed, He would indeed have guided you all."

source: قل هلم شهداءكم الذين يشهدون أن الله حرم هذا فإن شهدوا فلا تشهد معهم ولا تتبع أهواء الذين كذبوا بآياتنا والذين لا يؤمنون بالآخرة وهم بربهم يعدلون
en: Say: "Bring forward your witnesses, who can testify that Allah has forbidden this. Then if they testify, testify not you (O Muhammad صلى الله عليه وسلم) with them. And you should not follow the vain desires of such as treat Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) as falsehoods, and such as believe not in the Hereafter, and they hold others as equal (in worship) with their Lord."

source: قل تعالوا أتل ما حرم ربكم عليكم ألا تشركوا به شيئا وبالوالدين إحسانا ولا تقتلوا أولادكم من إملاق نحن نرزقكم وإياهم ولا تقربوا الفواحش ما ظهر منها وما بطن ولا تقتلوا النفس التي حرم الله إلا بالحق ذلكم وصاكم به لعلكم تعقلون
en: Say (O Muhammad صلى الله عليه وسلم): "Come, I will recite what your Lord has prohibited you from: Join not anything in worship with Him; be good and dutiful to your parents; kill not your children because of poverty - We provide sustenance for you and for them; come not near to Al-Fawahish (shameful sins, illegal sexual intercourse) whether committed openly or secretly; and kill not anyone whom Allah has forbidden, except for a just cause (according to Islamic law). This He has commanded you that you may understand.

source: ولا تقربوا مال اليتيم إلا بالتي هي أحسن حتى يبلغ أشده وأوفوا الكيل والميزان بالقسط لا نكلف نفسا إلا وسعها وإذا قلتم فاعدلوا ولو كان ذا قربى وبعهد الله أوفوا ذلكم وصاكم به لعلكم تذكرون
en: "And come not near to the orphan's property, except to improve it, until he (or she) attains the age of full strength; and give full measure and full weight with justice. We burden not any person, but that which he can bear. And whenever you give your word (i.e. judge between men or give evidence), say the truth even if a near relative is concerned, and fulfil the Covenant of Allah. This He commands you, that you may remember .

source: وأن هذا صراطي مستقيما فاتبعوه ولا تتبعوا السبل فتفرق بكم عن سبيله ذلكم وصاكم به لعلكم تتقون
en: "And verily, this (i.e. Allah's Commandments mentioned in the above two Verses 151 and 152) is My Straight Path, so follow it, and follow not (other) paths, for they will separate you away from His Path. This He has ordained for you that you may become Al-Muttaqun (the pious - see V.2:2)."

source: ثم آتينا موسى الكتاب تماما على الذي أحسن وتفصيلا لكل شيء وهدى ورحمة لعلهم بلقاء ربهم يؤمنون
en: Then, We gave Musa (Moses) the Book [the Taurat (Torah)] to complete (Our Favour) upon those who would do right, and explaining all things in detail and a guidance and a mercy that they might believe in the meeting with their Lord.

source: وهذا كتاب أنزلناه مبارك فاتبعوه واتقوا لعلكم ترحمون
en: And this is a blessed Book (the Qur'an) which We have sent down, so follow it and fear Allah (i.e. do not disobey His Orders), that you may receive mercy (i.e. be saved from the torment of Hell).

source: أن تقولوا إنما أنزل الكتاب على طائفتين من قبلنا وإن كنا عن دراستهم لغافلين
en: Lest you (pagan Arabs) should say: "The Book was sent down only to two sects before us (the Jews and the Christians), and for our part, we were in fact unaware of what they studied."

source: أو تقولوا لو أنا أنزل علينا الكتاب لكنا أهدى منهم فقد جاءكم بينة من ربكم وهدى ورحمة فمن أظلم ممن كذب بآيات الله وصدف عنها سنجزي الذين يصدفون عن آياتنا سوء العذاب بما كانوا يصدفون
en: Or lest you (pagan Arabs) should say: "If only the Book had been sent down to us, we would surely have been better guided than they (Jews and Christians)." So now has come unto you a clear proof (the Qur'an) from your Lord, and a guidance and a mercy. Who then does more wrong than one who rejects the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allah and turns away therefrom? We shall requite those who turn away from Our Ayat with an evil torment, because of their turning away (from them). [Tafsir At-Tabari]

source: هل ينظرون إلا أن تأتيهم الملائكة أو يأتي ربك أو يأتي بعض آيات ربك يوم يأتي بعض آيات ربك لا ينفع نفسا إيمانها لم تكن آمنت من قبل أو كسبت في إيمانها خيرا قل انتظروا إنا منتظرون
en: Do they then wait for anything other than that the angels should come to them, or that your Lord (Allah) should come, or that some of the Signs of your Lord should come (i.e. portents of the Hour e.g., rising of the sun from the west)! The day that some of the Signs of your Lord do come, no good will it do to a person to believe then, if he believed not before, nor earned good (by performing deeds of righteousness) through his Faith. Say: "Wait you! we (too) are waiting."

source: إن الذين فرقوا دينهم وكانوا شيعا لست منهم في شيء إنما أمرهم إلى الله ثم ينبئهم بما كانوا يفعلون
en: Verily, those who divide their religion and break up into sects (all kinds of religious sects) , you (O Muhammad صلى الله عليه وسلم) have no concern in them in the least. Their affair is only with Allah, Who then will tell them what they used to do.

source: من جاء بالحسنة فله عشر أمثالها ومن جاء بالسيئة فلا يجزى إلا مثلها وهم لا يظلمون
en: Whoever brings a good deed (Islamic Monotheism and deeds of obedience to Allah and His Messenger صلى الله عليه وسلم) shall have ten times the like thereof to his credit, and whoever brings an evil deed (polytheism, disbelief, hypocrisy, and deeds of disobedience to Allah and His Messenger صلى الله عليه وسلم) shall have only the recompense of the like thereof, and they will not be wronged.

source: قل إنني هداني ربي إلى صراط مستقيم دينا قيما ملة إبراهيم حنيفا وما كان من المشركين
en: Say (O Muhammad صلى الله عليه وسلم): "Truly, my Lord has guided me to a Straight Path, a right religion, the religion of Ibrahim (Abraham), Hanifa [i.e. the true Islamic Monotheism - to believe in One God (Allah i.e. to worship none but Allah, Alone)] and he was not of Al-Mushrikun (See V.2:105)."

source: قل إن صلاتي ونسكي ومحياي ومماتي لله رب العالمين
en: Say (O Muhammad صلى الله عليه وسلم): "Verily, my Salat (prayer), my sacrifice, my living, and my dying are for Allah, the Lord of the 'Alamin (mankind, jinn and all that exists).

source: لا شريك له وبذلك أمرت وأنا أول المسلمين
en: "He has no partner. And of this I have been commanded, and I am the first of the Muslims."

source: قل أغير الله أبغي ربا وهو رب كل شيء ولا تكسب كل نفس إلا عليها ولا تزر وازرة وزر أخرى ثم إلى ربكم مرجعكم فينبئكم بما كنتم فيه تختلفون
en: Say: "Shall I seek a lord other than Allah, while He is the Lord of all things? No person earns any (sin) except against himself (only), and no bearer of burdens shall bear the burden of another. Then unto your Lord is your return, so He will tell you that wherein you have been differing."

source: وهو الذي جعلكم خلائف الأرض ورفع بعضكم فوق بعض درجات ليبلوكم في ما آتاكم إن ربك سريع العقاب وإنه لغفور رحيم
en: And it is He Who has made you generations coming after generations, replacing each other on the earth. And He has raised you in ranks, some above others that He may try you in that which He has bestowed on you. Surely your Lord is Swift in retribution, and certainly He is Oft-Forgiving, Most Merciful.

source: المص
en: Alif-Lam-Mim-Sad. [These letters are one of the miracles of the Qur'an and none but Allah (Alone) knows their meanings.]

source: كتاب أنزل إليك فلا يكن في صدرك حرج منه لتنذر به وذكرى للمؤمنين
en: (This is the) Book (the Qur'an) sent down unto you (O Muhammad صلى الله عليه وسلم), so let not your breast be narrow therefrom, that you warn thereby; and a reminder unto the believers.

source: اتبعوا ما أنزل إليكم من ربكم ولا تتبعوا من دونه أولياء قليلا ما تذكرون
en: [Say (O Muhammad صلى الله عليه وسلم) to these idolaters (pagan Arabs) of your folk:] Follow what has been sent down unto you from your Lord (the Qur'an and Prophet Muhammad's Sunnah), and follow not any Auliya' (protectors and helpers who order you to associate partners in worship with Allah), besides Him (Allah). Little do you remember!

source: وكم من قرية أهلكناها فجاءها بأسنا بياتا أو هم قائلون
en: And a great number of towns (their population) We destroyed (for their crimes). Our torment came upon them (suddenly) by night or while they were taking their midday nap.

source: فما كان دعواهم إذ جاءهم بأسنا إلا أن قالوا إنا كنا ظالمين
en: No cry did they utter when Our Torment came upon them but this: "Verily, we were Zalimun (polytheists and wrong-doers)".

source: فلنسألن الذين أرسل إليهم ولنسألن المرسلين
en: Then surely, We shall question those (people) to whom it (the Book) was sent and verily, We shall question the Messengers.

source: فلنقصن عليهم بعلم وما كنا غائبين
en: Then surely, We shall narrate unto them (their whole story) with knowledge, and indeed We have not been absent.

source: والوزن يومئذ الحق فمن ثقلت موازينه فأولئك هم المفلحون
en: And the weighing on that day (Day of Resurrection) will be the true (weighing) . So as for those whose scale (of good deeds) will be heavy, they will be the successful (by entering Paradise).
